Revit 2026 API

# ViewSetWorksetVisibility Method

---

Sets visibility for a workset in this view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetWorksetVisibility(
	WorksetId worksetId,
	WorksetVisibility visible
)
```
```vb
Public Sub SetWorksetVisibility (
	worksetId As WorksetId,
	visible As WorksetVisibility
)
```
```cpp
public:
void SetWorksetVisibility(
	WorksetId^ worksetId,
	WorksetVisibility visible
)
```
```fsharp
member SetWorksetVisibility :
        worksetId : WorksetId *
        visible : WorksetVisibility -> unit
```

#### Parameters

worksetId WorksetId
     Id of the workset.
visible WorksetVisibility
     The visibility of the workset.

| Exception | Condition |
| --- | --- |
| ArgumentException | There is no workset with this Id in the document associated with this view. |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

It works even when the workset is closed. This settings overrules implicit visibility of the workset (for this particular view only).

#### Reference

View Class

Autodesk.Revit.DB Namespace